using System;

namespace T05.SpecialNumbers
{
    class Program
    {
        static void Main(string[] args)
        {
            int n = int.Parse(Console.ReadLine());

            for (int a = 1; a <= 9; a++)
            {
                for (int b = 1; b <= 9; b++)
                {
                    for (int c = 1; c <= 9; c++)
                    {
                        for (int d = 1; d <= 9; d++)
                        {
                            if ((n % a == 0 && n % b == 0 && n % c == 0 && n % d == 0))
                            {
                                Console.Write($"{a}{b}{c}{d} ");
                            }
                        }
                    }
                }
            }
        }
    }
}

//Да се напише програма, която чете едно цяло число N, въведено от потребителя,
//и генерира всички възможни "специални" числа от 1111 до 9999.
//За да бъде "специалнo" едно число, то трябва да отговаря на следното условие: 
//•	N да се дели на всяка една от неговите цифри без остатък.
//Пример: при N = 16, 2418 е специално число:
//•	16 / 2 = 8 без остатък
//•	16 / 4 = 4 без остатък
//•	16 / 1 = 16 без остатък
//•	16 / 8 = 2 без остатък
//Вход
//Входът се чете от конзолата и се състои от едно цяло число в интервала [1…600000]
//Изход
//На конзолата трябва да се отпечатат всички "специални" числа, разделени с интервал
