using System;

namespace T06.VetParking
{
    class Program
    {
        static void Main(string[] args)
        {
            //Вход
            //От конзолата се четaт два реда:
            //•	Брой дни – цяло число в интервала [1 … 5]
            //•	Брой часове за всеки един от дните - цяло число в интервала [1 … 24]
            int totalDays = int.Parse(Console.ReadLine());
            int totalHours = int.Parse(Console.ReadLine());

            double total = 0;
            

            for (int days = 1; days <= totalDays; days++)

            {
                double totalForTheDay = 0;
                for (int hours = 1; hours <= totalHours; hours++)
                {
                    
                    if (days % 2 == 0 && hours%2 != 0)
                    {
                        totalForTheDay += 2.50;

                    }
                    else if (days % 2 != 0 && hours % 2 == 0)
                    {
                        totalForTheDay += 1.25;
                    }
                    else
                    {
                        totalForTheDay += 1;
                    }
                }
                total += totalForTheDay;
                Console.WriteLine($"Day: {days} - {totalForTheDay:F2} leva");

            }
            
            
            Console.WriteLine($"Total: {total:f2} leva");
        }
    }
}

//Деси трябва да заведе котката си на ветеринар, но паркингът се заплаща.
//Напишете програма, която пресмята колко общо трябва да се плати за престоя на колата на Деси на паркинга.
//Паркингът е различен от останалите и има разнообразен ценоразпис. За всеки четен ден и нечетен час, паркингът таксува 2.50 лева.
//Във всеки нечетен ден и четен час таксата е 1.25 лева, във всички останали случаи се заплаща 1 лев.
//Таксуването става на всеки изминал час от деня.
//Всеки един от изходите трябва да бъде закръглен до втория знак след десетичната запетая.
//Изход:
//Да се отпечата на конзолата:
//•	За всеки изминал ден, общата сума, която трябва да се плати:
//"Day: {индексът на деня} – {общата сума за деня} leva"
//•	Когато програмата приключи:
//"Total: {общата сума за всички дни} leva"
// obqsneniq
//2 дни по 5 часа за всеки =>
//Ден 1 - нечетен, 1вият час също => таксата е равна на 1 лев
//Ден 1, 2рият час е четен => таксата е равна на 1.25 лева
//Ден 1, 3ти час => 1 лев
//Ден 1, 4ти час => 1.25 лева
//Ден 1, 5ти час => 1 лев 
//Ден 1 => обща сума – 5.50 лева

//Ден 2, 1ви час => таксата е равна на 2.50
//…..
//Ден 2 => обща сума – 9.50 лева

//Обща сума за всички дни => 5.50 + 9.50 = 15.00 лева
