using System;

namespace T04.CleverLily
{
    class Program
    {
        static void Main(string[] args)
        {
            int liliYearsOld = int.Parse(Console.ReadLine());
            double laundryPrice = double.Parse(Console.ReadLine());
            int priceForToy = int.Parse(Console.ReadLine());

            double money = 0;

            for (int i = 1; i <= liliYearsOld; i++)
            {
                if (i %2 == 0)
                {
                    money += (i * 5) - 1;
                }
                else
                {
                    money += priceForToy;
                }
            }
            double diff = money - laundryPrice;

            if (diff >= 0)
            {
                Console.WriteLine($"Yes! {diff:f2}");
            }
            else
            {
                Console.WriteLine($"No! {laundryPrice - money:f2}");
            }
        }
    }
}

//Лили вече е на N години. За всеки свой рожден ден тя получава подарък. 
//•	За нечетните рождени дни (1, 3, 5...n) получава играчки.
//•	За четните рождени дни (2, 4, 6...n) получава пари.
//За втория рожден ден получава 10.00 лв, като сумата се увеличава с 10.00 лв.,
//за всеки следващ четен рожден ден (2 -> 10, 4 -> 20, 6 -> 30...и т.н.).
//През годините Лили тайно е спестявала парите. Братът на Лили, в годините, които тя получава пари, взима по 1.00 лев от тях.
//Лили продала играчките получени през годините, всяка за P лева и добавила сумата към спестените пари.
//С парите искала да си купи пералня за X лева. Напишете програма,
//която да пресмята, колко пари е събрала и дали ѝ стигат да си купи пералня.
//Изход
//Да се отпечата на конзолата един ред:
//•	Ако парите на Лили са достатъчни:
//o "Yes! {N}" - където N е остатъка пари след покупката
//•	Ако парите не са достатъчни:
//o "No! {М}" - където M е сумата, която не достига
//Числата N и M трябва да за форматирани до вторият знак след десетичната запетая
